---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.HostObjFailures.HostMismatch
source: html/659e52bd-7f85-ca60-5891-84b7e077257a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.HostObjFailures.HostMismatch Property

Can't use this type in this host.

## Syntax (C#)
```csharp
public static FailureDefinitionId HostMismatch { get; }
```